openfoam/channelKEpsilon/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0]; // m^2/s^2

// Corrected internalField based on inlet I=0.05, U=1.0
// k_in = 1.5 * (U*I)^2 = 1.5 * (1.0*0.05)^2 = 0.00375
internalField   uniform 0.00375;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;           // Matched to calculation
        value           $internalField; // Use internal field as initial guess
    }
    outlet
    {
        type            zeroGradient; // Standard outflow condition
    }
    "(bottomWall|topWall)" // Matches blockMeshDict wall names
    {
        type            kqRWallFunction; // Standard k wall function
        value           $internalField;  // Value calculated by WF
    }
    frontAndBack // For 2D cases
    {
        type            empty;
    }
}

// ************************************************************************* //


/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0]; // m^2/s^2

// Corrected internalField based on inlet I=0.05, U=1.0
// k_in = 1.5 * (U*I)^2 = 1.5 * (1.0*0.05)^2 = 0.00375
internalField   uniform 0.00375;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;           // Matched to calculation
        value           $internalField; // Use internal field as initial guess
    }
    outlet
    {
        type            zeroGradient; // Standard outflow condition
    }
    "(bottomWall|topWall)" // Matches blockMeshDict wall names
    {
        type            kqRWallFunction; // Standard k wall function
        value           $internalField;  // Value calculated by WF
    }
    frontAndBack // For 2D cases
    {
        type            empty;
    }
}

// ************************************************************************* //