openfoam/channelKEpsilon/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       39700;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       39800;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       39900;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       40100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          40000;
        startFace       40300;
    }
)

// ************************************************************************* //
